fioLogs_clh_always_4cpu/fio-128k-write.log
file1: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
...
fio-3.1
Starting 8 processes

file1: (groupid=0, jobs=1): err= 0: pid=73: Wed Feb 19 04:46:59 2020
  write: IOPS=148, BW=18.5MiB/s (19.4MB/s)(16.4GiB/904534msec)
    slat (usec): min=16, max=6073.2k, avg=6743.23, stdev=155695.86
    clat (usec): min=3, max=6110.5k, avg=101202.38, stdev=600431.89
     lat (msec): min=2, max=6114, avg=107.95, stdev=619.93
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   14],
     | 30.00th=[   19], 40.00th=[   23], 50.00th=[   29], 60.00th=[   34],
     | 70.00th=[   41], 80.00th=[   50], 90.00th=[   61], 95.00th=[   71],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=84992, per=2.06%, avg=3103.86, stdev=12694.60, samples=643
   iops        : min=    0, max=  664, avg=23.78, stdev=99.27, samples=643
  lat (usec)   : 4=0.01%
  lat (msec)   : 4=0.39%, 10=8.46%, 20=24.92%, 50=47.43%, 100=17.30%
  lat (msec)   : 250=0.07%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.04%
  lat (msec)   : >=2000=1.33%
  cpu          : usr=0.37%, sys=6.69%, ctx=372482, majf=0, minf=70074
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,134068,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=74: Wed Feb 19 04:46:59 2020
  write: IOPS=150, BW=18.9MiB/s (19.8MB/s)(16.7GiB/904537msec)
    slat (usec): min=15, max=6072.9k, avg=6621.11, stdev=154282.92
    clat (usec): min=18, max=6104.3k, avg=99368.43, stdev=594825.87
     lat (msec): min=2, max=6106, avg=105.99, stdev=614.12
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    7], 10.00th=[   10], 20.00th=[   14],
     | 30.00th=[   18], 40.00th=[   23], 50.00th=[   28], 60.00th=[   34],
     | 70.00th=[   40], 80.00th=[   49], 90.00th=[   61], 95.00th=[   70],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=97024, per=2.09%, avg=3149.92, stdev=13132.37, samples=645
   iops        : min=    0, max=  758, avg=24.17, stdev=102.69, samples=645
  lat (usec)   : 20=0.01%
  lat (msec)   : 4=0.53%, 10=10.15%, 20=25.11%, 50=45.87%, 100=16.88%
  lat (msec)   : 250=0.07%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.04%
  lat (msec)   : >=2000=1.31%
  cpu          : usr=0.37%, sys=5.97%, ctx=363528, majf=0, minf=70095
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,136540,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=75: Wed Feb 19 04:46:59 2020
  write: IOPS=145, BW=18.2MiB/s (19.0MB/s)(16.0GiB/904536msec)
    slat (usec): min=15, max=6073.4k, avg=6882.20, stdev=157279.43
    clat (usec): min=17, max=6124.0k, avg=103285.76, stdev=606530.75
     lat (msec): min=2, max=6131, avg=110.17, stdev=626.22
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   14],
     | 30.00th=[   19], 40.00th=[   24], 50.00th=[   30], 60.00th=[   35],
     | 70.00th=[   42], 80.00th=[   51], 90.00th=[   62], 95.00th=[   72],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=162560, per=2.37%, avg=3574.66, stdev=15570.30, samples=644
   iops        : min=    0, max= 1270, avg=27.46, stdev=121.71, samples=644
  lat (usec)   : 20=0.01%
  lat (msec)   : 4=0.43%, 10=8.97%, 20=24.10%, 50=46.51%, 100=18.43%
  lat (msec)   : 250=0.09%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.05%
  lat (msec)   : >=2000=1.36%
  cpu          : usr=0.41%, sys=6.73%, ctx=357343, majf=0, minf=70094
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,131363,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=76: Wed Feb 19 04:46:59 2020
  write: IOPS=145, BW=18.1MiB/s (19.0MB/s)(16.0GiB/904535msec)
    slat (usec): min=15, max=6072.7k, avg=6887.84, stdev=157351.44
    clat (usec): min=4, max=6128.5k, avg=103372.22, stdev=606728.92
     lat (msec): min=2, max=6134, avg=110.26, stdev=626.43
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    9], 10.00th=[   12], 20.00th=[   16],
     | 30.00th=[   20], 40.00th=[   24], 50.00th=[   30], 60.00th=[   35],
     | 70.00th=[   41], 80.00th=[   50], 90.00th=[   61], 95.00th=[   71],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=80640, per=1.83%, avg=2765.66, stdev=11365.28, samples=644
   iops        : min=    0, max=  630, avg=21.14, stdev=88.88, samples=644
  lat (usec)   : 10=0.01%
  lat (msec)   : 4=0.32%, 10=7.25%, 20=23.97%, 50=49.47%, 100=17.46%
  lat (msec)   : 250=0.06%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.05%
  lat (msec)   : >=2000=1.36%
  cpu          : usr=0.29%, sys=4.81%, ctx=361700, majf=0, minf=70075
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,131254,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=77: Wed Feb 19 04:46:59 2020
  write: IOPS=143, BW=17.9MiB/s (18.8MB/s)(15.8GiB/904534msec)
    slat (usec): min=16, max=6072.0k, avg=6978.47, stdev=158429.55
    clat (usec): min=117, max=6119.5k, avg=104825.42, stdev=610710.71
     lat (msec): min=2, max=6121, avg=111.81, stdev=630.52
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   15],
     | 30.00th=[   20], 40.00th=[   24], 50.00th=[   30], 60.00th=[   35],
     | 70.00th=[   42], 80.00th=[   51], 90.00th=[   63], 95.00th=[   73],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=93815, per=2.11%, avg=3186.80, stdev=12992.67, samples=643
   iops        : min=    0, max=  732, avg=24.41, stdev=101.49, samples=643
  lat (usec)   : 250=0.01%
  lat (msec)   : 4=0.47%, 10=8.31%, 20=23.48%, 50=47.16%, 100=19.05%
  lat (msec)   : 250=0.05%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.05%
  lat (msec)   : >=2000=1.38%
  cpu          : usr=0.37%, sys=6.15%, ctx=359397, majf=0, minf=70098
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,129435,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=78: Wed Feb 19 04:46:59 2020
  write: IOPS=145, BW=18.2MiB/s (19.0MB/s)(16.0GiB/904534msec)
    slat (usec): min=16, max=6072.7k, avg=6877.09, stdev=157224.03
    clat (usec): min=105, max=6114.2k, avg=103208.00, stdev=606360.52
     lat (msec): min=2, max=6115, avg=110.09, stdev=626.04
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   15],
     | 30.00th=[   19], 40.00th=[   24], 50.00th=[   30], 60.00th=[   35],
     | 70.00th=[   41], 80.00th=[   50], 90.00th=[   63], 95.00th=[   73],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=88674, per=2.17%, avg=3281.42, stdev=13617.31, samples=645
   iops        : min=    0, max=  692, avg=25.15, stdev=106.39, samples=645
  lat (usec)   : 250=0.01%
  lat (msec)   : 4=0.45%, 10=8.64%, 20=24.11%, 50=47.24%, 100=17.99%
  lat (msec)   : 250=0.12%, 750=0.01%, 1000=0.03%, 2000=0.05%, >=2000=1.35%
  cpu          : usr=0.27%, sys=4.90%, ctx=358601, majf=0, minf=70094
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,131459,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=79: Wed Feb 19 04:46:59 2020
  write: IOPS=152, BW=19.0MiB/s (19.0MB/s)(16.8GiB/904533msec)
    slat (usec): min=15, max=6072.4k, avg=6560.23, stdev=153570.79
    clat (usec): min=26, max=6103.4k, avg=98454.10, stdev=592191.30
     lat (msec): min=2, max=6106, avg=105.02, stdev=611.41
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   14],
     | 30.00th=[   19], 40.00th=[   23], 50.00th=[   29], 60.00th=[   34],
     | 70.00th=[   39], 80.00th=[   47], 90.00th=[   58], 95.00th=[   68],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=98124, per=2.07%, avg=3132.49, stdev=12920.17, samples=643
   iops        : min=    0, max=  766, avg=23.99, stdev=100.93, samples=643
  lat (usec)   : 50=0.01%
  lat (msec)   : 4=0.52%, 10=8.69%, 20=24.73%, 50=49.66%, 100=14.96%
  lat (msec)   : 250=0.05%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.04%
  lat (msec)   : >=2000=1.30%
  cpu          : usr=0.33%, sys=5.91%, ctx=367843, majf=0, minf=70097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,137808,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=80: Wed Feb 19 04:46:59 2020
  write: IOPS=149, BW=18.7MiB/s (19.6MB/s)(16.5GiB/904534msec)
    slat (usec): min=15, max=6072.6k, avg=6696.91, stdev=155152.61
    clat (usec): min=19, max=6115.9k, avg=100506.68, stdev=598184.45
     lat (msec): min=2, max=6120, avg=107.20, stdev=617.59
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    8], 10.00th=[   11], 20.00th=[   14],
     | 30.00th=[   19], 40.00th=[   24], 50.00th=[   29], 60.00th=[   34],
     | 70.00th=[   40], 80.00th=[   48], 90.00th=[   60], 95.00th=[   71],
     | 99.00th=[ 5336], 99.50th=[ 5470], 99.90th=[ 5671], 99.95th=[ 5738],
     | 99.99th=[ 6074]
   bw (  KiB/s): min=    0, max=85847, per=2.23%, avg=3363.30, stdev=13835.76, samples=646
   iops        : min=    0, max=  670, avg=25.79, stdev=108.09, samples=646
  lat (usec)   : 20=0.01%
  lat (msec)   : 4=0.45%, 10=8.48%, 20=24.69%, 50=48.61%, 100=16.30%
  lat (msec)   : 250=0.06%, 500=0.01%, 750=0.01%, 1000=0.03%, 2000=0.04%
  lat (msec)   : >=2000=1.32%
  cpu          : usr=0.33%, sys=5.79%, ctx=365313, majf=0, minf=70096
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,134995,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=147MiB/s (155MB/s), 17.9MiB/s-19.0MiB/s (18.8MB/s-19.0MB/s), io=130GiB (140GB), run=904533-904537msec